** Console Count:

#+begin_src js :results output

  console.count();
  console.count();
  console.count();
  console.count();

  for(let i=0; i < 5; i++) {
    console.count('I have been called') }


#+end_src

#+RESULTS:
: default: 1
: default: 2
: default: 3
: default: 4
: I have been called: 1
: I have been called: 2
: I have been called: 3
: I have been called: 4
: I have been called: 5

** Console Groups:

#+begin_src js :results output
  #+begin_src js :results output

    const dogName = {
    name: 'Paw',
    surname: 'Patrol'
  }
  console.log();
  console.log(dogName);
  console.log();
  console.table(dogName);

    // console.group()
  console.group('Dogs');
  console.log('German Shepard');
  console.log('Irish Wolfhound');
  console.groupEnd();

  // console.groupCollapsed()
  console.groupCollapsed('Dogs');
  console.log('German Shepard');
  console.log('Irish Wolfhound');
  console.groupEnd();

  // console.groupCollapsed()
  console.groupCollapsed('Animals');
  console.group('Dogs');
  console.log('German Shepard');
  console.log('Irish Wolfhound');
  console.groupEnd();
  console.group('Cats');
  console.log('Siamese');
  console.log('Rag');
  console.groupEnd();

#+end_src

#+RESULTS:
#+begin_example
Dogs
  German Shepard
  Irish Wolfhound
Dogs
  German Shepard
  Irish Wolfhound
Animals
  Dogs
    German Shepard
    Irish Wolfhound
  Cats
    Siamese
    Rag
#+end_example

** Console Time:

#+begin_src js :results output

  console.time('math timer');
  console.log(2345234523452345*224351234512);
  console.timeEnd('math timer');

#+end_src

#+RESULTS:
: 5.261562605566956e+26
: math timer: 2.031ms

**** 

#+begin_src js :results output

    console.log('hi %s', 'there');

    var number = 33;
    var color = 'green';

    console.log('%d %s apples', number, color);


#+end_src

#+RESULTS:
: hi there
: 33 green apples
: I am button

** Template Literals ${} syntax

#+begin_src js :results output

  var number = 33;
  var color = 'green';

  console.log(`${number} ${color} apples`);

#+end_src

#+RESULTS:
: 33 green apples

